InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/GPIO/Header/Peripheral/Register/RegisterDefines/GPIO_RegisterDefines_DIR.h
/**
 *
 * @file GPIO_RegisterDefines_DIR.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 25 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 25 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_GPIO_GPIO_PERIPHERAL_GPIO_REGISTER_GPIO_REGISTERDEFINES_GPIO_REGISTERDEFINES_DIR_H_
#define XDRIVER_MCU_DRIVER_HEADER_GPIO_GPIO_PERIPHERAL_GPIO_REGISTER_GPIO_REGISTERDEFINES_GPIO_REGISTERDEFINES_DIR_H_

#include <stdint.h>

/******************************************************************************************
************************************ 2 GPIODIR *********************************************
******************************************************************************************/
/*----------*/
#define GPIO_GPIODIR_R_DIR_MASK         ((uint32_t)0x000000FFu)
#define GPIO_GPIODIR_R_DIR_BIT          (0u)
#define GPIO_GPIODIR_R_DIR_INPUT        ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_R_DIR_OUTPUT       ((uint32_t)0x000000FFu)

#define GPIO_GPIODIR_DIR_MASK           ((uint32_t)0x000000FFu)
#define GPIO_GPIODIR_DIR_INPUT          ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_DIR_OUTPUT         ((uint32_t)0x000000FFu)
/*----------*/

/*----------*/
#define GPIO_GPIODIR_R_DIR0_MASK        ((uint32_t)0x00000001u)
#define GPIO_GPIODIR_R_DIR0_BIT         (0u)
#define GPIO_GPIODIR_R_DIR0_INPUT       ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_R_DIR0_OUTPUT      ((uint32_t)0x00000001u)

#define GPIO_GPIODIR_DIR0_MASK          ((uint32_t)0x00000001u)
#define GPIO_GPIODIR_DIR0_INPUT         ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_DIR0_OUTPUT        ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODIR_R_DIR1_MASK        ((uint32_t)0x00000002u)
#define GPIO_GPIODIR_R_DIR1_BIT         (1u)
#define GPIO_GPIODIR_R_DIR1_INPUT       ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_R_DIR1_OUTPUT      ((uint32_t)0x00000002u)

#define GPIO_GPIODIR_DIR1_MASK          ((uint32_t)0x00000001u)
#define GPIO_GPIODIR_DIR1_INPUT         ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_DIR1_OUTPUT        ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODIR_R_DIR2_MASK        ((uint32_t)0x00000004u)
#define GPIO_GPIODIR_R_DIR2_BIT         (2u)
#define GPIO_GPIODIR_R_DIR2_INPUT       ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_R_DIR2_OUTPUT      ((uint32_t)0x00000004u)

#define GPIO_GPIODIR_DIR2_MASK          ((uint32_t)0x00000001u)
#define GPIO_GPIODIR_DIR2_INPUT         ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_DIR2_OUTPUT        ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODIR_R_DIR3_MASK        ((uint32_t)0x00000008u)
#define GPIO_GPIODIR_R_DIR3_BIT         (3u)
#define GPIO_GPIODIR_R_DIR3_INPUT       ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_R_DIR3_OUTPUT      ((uint32_t)0x00000008u)

#define GPIO_GPIODIR_DIR3_MASK          ((uint32_t)0x00000001u)
#define GPIO_GPIODIR_DIR3_INPUT         ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_DIR3_OUTPUT        ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODIR_R_DIR4_MASK        ((uint32_t)0x00000010u)
#define GPIO_GPIODIR_R_DIR4_BIT         (4u)
#define GPIO_GPIODIR_R_DIR4_INPUT       ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_R_DIR4_OUTPUT      ((uint32_t)0x00000010u)

#define GPIO_GPIODIR_DIR4_MASK          ((uint32_t)0x00000001u)
#define GPIO_GPIODIR_DIR4_INPUT         ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_DIR4_OUTPUT        ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODIR_R_DIR5_MASK        ((uint32_t)0x00000020u)
#define GPIO_GPIODIR_R_DIR5_BIT         (5u)
#define GPIO_GPIODIR_R_DIR5_INPUT       ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_R_DIR5_OUTPUT      ((uint32_t)0x00000020u)

#define GPIO_GPIODIR_DIR5_MASK          ((uint32_t)0x00000001u)
#define GPIO_GPIODIR_DIR5_INPUT         ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_DIR5_OUTPUT        ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODIR_R_DIR6_MASK        ((uint32_t)0x00000040u)
#define GPIO_GPIODIR_R_DIR6_BIT         (6u)
#define GPIO_GPIODIR_R_DIR6_INPUT       ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_R_DIR6_OUTPUT      ((uint32_t)0x00000040u)

#define GPIO_GPIODIR_DIR6_MASK          ((uint32_t)0x00000001u)
#define GPIO_GPIODIR_DIR6_INPUT         ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_DIR6_OUTPUT        ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODIR_R_DIR7_MASK        ((uint32_t)0x00000080u)
#define GPIO_GPIODIR_R_DIR7_BIT         (7u)
#define GPIO_GPIODIR_R_DIR7_INPUT       ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_R_DIR7_OUTPUT      ((uint32_t)0x00000080u)

#define GPIO_GPIODIR_DIR7_MASK          ((uint32_t)0x00000001u)
#define GPIO_GPIODIR_DIR7_INPUT         ((uint32_t)0x00000000u)
#define GPIO_GPIODIR_DIR7_OUTPUT        ((uint32_t)0x00000001u)
/*----------*/




#endif /* XDRIVER_MCU_DRIVER_HEADER_GPIO_GPIO_PERIPHERAL_GPIO_REGISTER_GPIO_REGISTERDEFINES_GPIO_REGISTERDEFINES_DIR_H_ */
